artillery.yaml
config:
  target: "https://wa-identity-sso.azurewebsites.net"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 20
      name: Inicialização da aplicação
    - duration: 120
      arrivalRate: 25
      name: Carga máxima sustentada
scenarios:
  - flow:
      - post:
          url: "/connect/token"
          headers:
            content-type: "application/x-www-form-urlencoded"
          form:
            grant_type: "client_credentials"
            scope: "admin_api"
            client_id: "azure-poc-identity"
            client_secret: "01598100745d4c7ab5ae160d824bcea1"
          expect:
            - statusCode:200