artillery.yaml
config:
  target: "https://wa-identity-sso.azurewebsites.net"
  phases:
    - duration: 120
      arrivalRate: 1
scenarios:
  - flow:
      - post:
          url: "/connect/token"
          headers:
            content-type: "application/x-www-form-urlencoded"
          form:
            grant_type: "client_credentials"
            scope: "openid profile"
            client_id: "AdAzure"
            client_secret: "769a1861-ab06-4d0b-9b78-ff69ff27f939"
          expect:
            - statusCode:200